Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བདག་དང་ཕ་རོལ་གྱི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུ་གང་ཡིན་པ་དང་། རྐྱེན་གང་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་རྒྱུ་གང་ཡིན་པ་དང་། རྐྱེན་གང་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལ་རྒྱུ་གང་། རྐྱེན་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུ་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པའོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྐྱེན་ནི་མ་རིག་པའོ། ། མ་རིག་པ་ནི་རྒྱུའོ། ། འདུ་བྱེད་ནི་རྐྱེན་ཏོ། ། འདུ་བྱེད་ནི་རྒྱུའོ། ། རྣམ་པར་ཤེས་པ་ནི་རྐྱེན་ཏོ། ། རྣམ་པར་ཤེས་པ་ནི་རྒྱུའོ། ། མིང་དང་གཟུགས་ནི་རྐྱེན་ཏོ། ། མིང་དང་གཟུགས་ནི་རྒྱུའོ། ། སྐྱེ་མཆེད་དྲུག་ནི་རྐྱེན་ཏོ། ། སྐྱེ་མཆེད་དྲུག་ནི་རྒྱུའོ། ། རེག་པ་ནི་རྐྱེན་ཏོ། ། རེག་པ་ནི་རྒྱུའོ། ། ཚོར་བ་ནི་རྐྱེན་ཏོ། ། ཚོར་བ་ནི་རྒྱུའོ། ། སྲེད་པ་ནི་རྐྱེན་ཏོ། ། སྲེད་པ་ནི་རྒྱུའོ། ། ལེན་པ་ནི་རྐྱེན་ཏོ། ། ལེན་པ་ནི་རྒྱུའོ། ། སྲིད་པ་ནི་རྐྱེན་ཏོ། ། སྲིད་པ་ནི་རྒྱུའོ། ། སྐྱེ་བ་ནི་རྐྱེན་ཏོ། ། སྐྱེ་བ་ནི་རྒྱུའོ། ། རྒ་ཤི་ནི་རྐྱེན་ཏོ། ། ཉོན་མོངས་པ་ནི་རྒྱུའོ། ། ལས་ནི་རྐྱེན་ཏོ། ། ལྟ་བ་ནི་རྒྱུའོ། ། སྲེད་པ་ནི་རྐྱེན་ཏོ། ། བག་ལ་ཉལ་ནི་རྒྱུའོ། །ཀུན་ནས་ལྡང་བ་ནི་རྐྱེན་ཏོ། ། སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བའི་རྒྱུ་ནི་འདི་རྐྱེན་ནི་འདི་ཡིན་ཏེ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What are these causes and conditions? The cause of the corruptions of all sentient beings is false mental construction, and the condition for the corruptions of all sentient beings is ignorance. The cause is ignorance, and the condition is mental conditioning. The cause is mental conditioning, and the condition is consciousness. The cause is consciousness, and the condition is name and form. The cause is name and form, and the condition is the six sense fields. The cause is the six sense fields, and the condition is contact. The cause is contact, and the condition is feeling. The cause is feeling, and the condition is desire. The cause is desire, and the condition is grasping. The cause is grasping, and the condition is becoming. The cause is becoming, and the condition is birth. The cause is birth, and the condition is aging and death. The cause is the vices, and the condition is the results of previous actions. The cause is views, and the condition is attachment. The cause is habitual tendencies, and the condition is obsessions. These are the causes and conditions of the corruptions of sentient beings, and the Tathāgata knows them as they really are.

source: དེ་ལ་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་གང་། རྐྱེན་གང་ཞེ་ན། སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་གཉིས་རྐྱེན་གཉིས་ཏེ། གཞན་ལས་རྗེས་སུ་འཐུན་པའི་སྒྲ་དང་། སོ་སོ་བདག་ཉིད་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའོ། ། འདི་ལྟ་སྟེ། ཞི་གནས་ལ་རྩེ་གཅིག་པ་དང་། ལྷག་མཐོང་ལ་མཁས་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། འགྲོ་བ་མེད་པར་ཤེས་པ་དང་། འོང་བ་མེད་པར་ཤེས་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། སྐྱེ་བ་མེད་པར་རབ་ཏུ་རྟོགས་པ་དང་། ངེས་པར་གྱུར་པ་ལ་མི་རེག་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། རྐང་པར་ལྡན་པ་དང་། རིག་པས་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱེད་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། རྣམ་པར་ཐར་པའི་སྒོ་ལ་སྒོམ་པ་དང་། རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བར་ཤེས་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པའོ། ། གཞན་ཡང་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཏེ། བདེན་པ་རྗེས་སུ་རྟོགས་པ་དང་། བདེན་པ་རྗེས་སུ་ཐོབ་པའོ། ། རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ནི་སེམས་ཅན་རྣམས་རྣམ་པར་དག་པར་འགྱུར་བ་སྟེ། དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What are the causes and conditions necessary for the purification of sentient beings to take place? There are two causes, two conditions, for the purification of sentient beings. What are they? They are adapting one’s words to one’s listeners while maintaining a profound inner understanding. They are keeping focus in calm abiding meditation and being skilled in insight meditation. Two further causes, two further conditions, are understanding that there is no coming and understanding that there is no going. Two further causes, two further conditions, are examining nonbecoming and not becoming restricted. Two further causes, two further conditions, are engaging in good conduct and realizing liberating awareness. Two further causes, two further conditions, are engaging in training for emancipation and understanding natural liberation. Two further causes, two further conditions, are understanding cessation and understanding nonarising. Two further causes, two further conditions, are investigating truth and reaching truth. These are the causes, these are the conditions, for the purification of sentient beings to take place, and the Tathāgata knows them as they really are.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པ་ཡང་ཚད་མེད། རྣམ་པར་དག་པར་དམིགས་པ་ཡང་ཚད་མེད་དེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པས་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པ། རྣམ་པར་དག་པའི་དམིགས་པ་ལ་འཇོག་པ་ཡང་ཡོད་དོ། ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པས་རྣམ་པར་དག་པ་ལ་དམིགས་པ་ཡང་ཀུན་ནས་ཉོན་མོངས་པར་དམིགས་པ་ལ་འཇོག་པ་ཡང་ཡོད་མངོན་པའི་ང་རྒྱལ་གྱི་འཛིན་པས་ཀུན་ནས་ཉོན་མོངས་པར་དམིགས་པ་ལ་འཇོག་པ་དང་། རྣམ་པར་དག་པའི་དམིགས་པ་ལ་འཇོག་པའང་ཡོད་དེ དེ་ལས་སྣྲེལ་ཞིའི་རྣམ་གྲངས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འཇུག་གོ །
en: “Moreover, Śāriputra, the defiled objects to which sentient beings relate are immeasurable, and the pure objects to which sentient beings relate are immeasurable. When one considers a defiled object as it really is, it can be engaged with as a pure object. When one considers a pure object as it really is, it can be engaged with as a defiled object. When one is conceited, one can engage with defiled objects, and one can engage with pure objects. With this knowledge, the Tathāgata relates to objects in these divergent ways.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་འདི་ལྟ་བུ་དང་ལྡན་པས་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ་དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་ གནས་སོ། ། བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་ གནས་ནས་ འགོག་པ་ལས་ལྡང་བ་དང་། འགོག་པ་ལ་སྙོམས་པར་ཞུགས་ནས་ བསམ་གཏན་དང་པོ་ལས་ལྡང་བའི་བར་དུའོ། །
en: “Śāriputra, the Tathāgata, who possesses this kind of knowledge, has left desires behind. He has left evil, unwholesome qualities behind, and he attains and abides in the first meditative state, the state of joy and happiness that is born from seclusion and that includes conceptualization and deliberation. When he has reached and dwelt in the first meditative state, he emerges from this cessation, and so forth. When cessation has been attained, he emerges from the first meditative state.

source: རྣམ་པར་ཐར་པ་བརྒྱད་ལ་རྗེས་སུ་འཐུན་པར་སྙོམས་པར་འཇུག་གོ ། མི་འཐུན་པར་ཡང་སྙོམས་པར་འཇུག་གོ ། རྗེས་སུ་འཐུན་པ་དང་མི་འཐུན་པར་སྙོམས་པར་འཇུག་སྟེ། བརྒྱད་གང་ཞེ་ན། །འདི་ལྟ་སྟེ། གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ། ། ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་གཉིས་པའོ། ། སྡུག་པའི་རྣམ་པར་ཐར་པ་སྡུག་པ་ཉིད་དུ་མོས་པར་འགྱུར་བ་དེ་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ། ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དེ་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ། ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དེ་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དེ་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ། ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དེ་ནི་རྣམ་པར་ཐར་པ་བདུན་པའོ། ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་དེ་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་པ་སྟེ། རྣམ་པར་ཐར་པ་བརྒྱད་པོ་འདི་དག་ལ་རྗེས་སུ་འཐུན་པ་དང་། མི་འཐུན་པར་ཡང་སྙོམས་པར་འཇུག་སྣྲེལ་ཞིར་ཡང་སྙོམས་པར་འཇུག་གོ ། ཏིང་ངེ་འཛིན་ལ་ཡང་ཏིང་ངེ་འཛིན་སྟོན་ལ་སྙོམས་པར་འཇུག་པས་རྟོགས་པར་སྟོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལ་ཐ་དད་པར་འགྱུར་བ་གང་ཡང་མེད། དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་ལ་དམིགས་པ་ལས་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་བྱ་བ་མེད། དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་གཅིག་གིས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་འགྲུབ་བོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་ལས་མ་བཞེངས་པར་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་གཅིག་ནས་གཅིག་ཏུ་འཇུག་པ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མཉམ་པར་མ་བཞག་པ་མི་དམིགས་སོ། །
en: “He attains the eight liberations in order from first to last, and in reverse order from last to first. He attains them both in order and in reverse order. What are these eight liberations? The first liberation is when one with form sees forms. The second liberation is when the internal formless consciousness sees external forms. The third liberation is when the beauty of liberation attracts one toward this quality of beauty. The fourth liberation is the attainment of the abode of limitless space. The fifth liberation is the attainment of the abode of limitless consciousness. The sixth liberation is the attainment of the abode of nothing whatsoever. The seventh liberation is the attainment of the abode of neither perception nor nonperception. The eighth liberation is the cessation of perception and feeling. He attains the eight liberations in order from first to last, and in reverse order from last to first. He teaches that there are levels of concentration that can be seen within the accomplishment of concentration, but one cannot really make any distinctions within the Tathāgata’s concentration or attain the concentration of a tathāgata by making it into an object. Through a single concentration the Tathāgata enters into all concentrations, and when he emerges, the Tathāgata accomplishes all concentrations. The mind of the Tathāgata does not enter into them one after the other. The mind of the Tathāgata can never be perceived as not being composed. No one is able to observe the concentration of the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་སུས་ཀྱང་བལྟ་མི་ནུས་ཏེ། ཉན་ཐོས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ཟིལ་གྱིས་ནོན་ཏོ། ། རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱིས་ཟིལ་གྱིས་ནོན་ཏོ། ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ནི་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ཟིལ་གྱིས་ནོན་ཏོ། ། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་ཟིལ་གྱིས་མ་ནོན་པ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནི་ཟིལ་གྱིས་མ་ནོན་པར་འཇུག་གོ ། གདམས་པ་གང་དང་རྗེས་སུ་བསྟན་པ་གང་གིས་ཉན་ཐོས་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་སྐྱེད་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་བཞིན་དུ་རང་སངས་རྒྱས་ཀྱི་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་འདོམས་ཤིང་དེ་བཞིན་དུ་རྗེས་སུ་སྟོན་ཏོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་མཁྱེན་པའི་སྟོབས་དེ་ནི་མཐའ་ཡས་མུ་མེད་དེ ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ཅིང་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “The concentration of a śrāvaka is surpassed by the concentration of a pratyekabuddha, the concentration of a pratyekabuddha is surpassed by the concentration of a bodhisatva, and the concentration of a bodhisatva is surpassed by the concentration of a buddha. The concentration of the Tathāgata cannot be surpassed. The knowledge of the Tathāgata cannot be surpassed. The Tathāgata knows how to instruct and how to give advice so that the śrāvaka develops concentration, and he will instruct and give advice according to this knowledge. Śāriputra, the Tathāgata’s power to know how the corruptions arise and are purified in the context of liberative meditative states, the attainments of concentration, is as boundless as space. When the bodhisatva learns of this, he develops faith, trust, and confidence, and he is without uncertainty and doubt. It brings him pleasure, joy, and satisfaction, and as this power is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: གང་གིས་སེམས་ཅན་ཉོན་མོངས་ཤིང་། །གང་གིས་སེམས་ཅན་རྣམ་དག་འགྱུར། །
en: “That which corrupts sentient beings And that which purifies sentient beings—

source: དེ་ཡང་དཔའ་བོ་ཆེན་པོས་མཁྱེན། །
en: This the great hero knows,

source: མཁྱེན་ནས་གཏམ་རྣམས་སྟོན་པར་མཛད། །
en: And his teaching is in accord with this knowledge.

source: གང་དུ་མ་རིག་སྐྱེ་འགྱུར་བ། །ཉོན་མོངས་རྒྱུ་ནི་ཚུལ་བཞིན་མིན། །
en: “Superficial understanding is the cause of the vices Where ignorance appears.

source: དེ་ཡི་རྐྱེན་ནི་འདུ་བྱེད་དེ། །
en: With its conditions and mental conditioning,

source: སྡུག་བསྔལ་རབ་ཏུ་སྐྱེ་བར་འགྱུར། །
en: Suffering comes into being.

source: སྲིད་པའི་ཡན་ལག་སྐྱེད་པ་ཡི། །ཐམས་ཅད་རྩ་བ་ཚུལ་བཞིན་མིན། །
en: “Superficial understanding is the root of everything, The mother of all strands of existence.

source: དེ་ཉིད་སངས་རྒྱས་རབ་མཁྱེན་ནས། །
en: The Buddha understands this truth,

source: དེ་བཞིན་དུ་ཡང་སྟོན་པར་མཛད། །
en: And he gives explanations accordingly.

source: ལས་ཀྱི་རྩ་བ་ཉོན་མོངས་པ། །མི་མཁས་མངོན་པར་འདུ་བྱེད་དེ། །
en: “The corruptions are the roots of action, And the ignorant keep creating them.

source: སྡུག་བསྔལ་འབྱུང་བར་འགྱུར་བའི་བར། །དེ་ཡི་རྐྱེན་ནི་རྣམ་པར་ཤེས། །
en: As long as the condition of consciousness is present, Suffering comes into being.

source: གང་གིས་སེམས་ཅན་དག་འགྱུར་པ། །རྒྱུ་གཉིས་དང་ནི་རྐྱེན་གཉིས་ཏེ། ། གཞན་ལས་རྗེས་སུ་འཐུན་སྒྲ་དང་། མང་དུ་ཚུལ་བཞིན་ལྟ་བའོ། །
en: “He adapts his words to his listeners And has a profound inner understanding. These are two causes, two conditions, That purify sentient beings.

source: ཚུལ་བཞིན་རྒྱུ་ནི་ཞི་གནས་ཏེ། །
en: “Calm abiding is the fundamental cause,

source: ལྷག་མཐོང་ཡང་ནི་རྐྱེན་ཡིན་ནོ། །
en: Insight meditation is the condition.

source: སེམས་ཅན་གང་གིས་འགྲོར་འགྱུར་བ། །དེ་ཡང་འདྲེན་པས་རབ་ཏུ་མཁྱེན། །
en: This liberates sentient beings. This the leader knows.

source: ཚུལ་ཁྲིམས་ལ་ནི་རྣལ་འབྱོར་གནས། །
en: “Abiding by the practice of morality

source: ཆོས་རྣམས་སྟོང་པར་རབ་ཏུ་རྟོག །
en: And seeing that phenomena are empty,

source: ཐར་པའི་ལམ་ནི་བསྒོམས་པས་ན། །
en: Through applying these means to liberation

source: སྲིད་པ་དོག་ལས་ཐར་བར་འགྱུར། །
en: One is rescued from the straits of existence.

source: དེ་དག་སངས་རྒྱས་རབ་མཁྱེན་ནས། །
en: “The Buddha knows the ways

source: རྣམ་སྦྱོང་སྐྱེས་པ་བུད་མེད་ལ། །སྟོང་པ་ཉིད་དང་མཚན་མེད་དང་། །རྣམ་པར་ཐར་པ་རབ་ཏུ་སྟོན། །
en: Of purification for men and women, With emptiness and freedom from attributes, He directs them toward liberation.

source: བསམ་གཏན་ལ་ནི་སྙོམས་ཞུགས་པ། །རང་རྒྱལ་དང་ནི་ཉན་ཐོས་རྣམས། །དེ་དག་རྣམས་ཀྱང་དོག་པར་བཤད། །དེ་ནི་འགྲན་ཟླ་ཡོད་པར་གསུངས། །
en: “The śrāvakas and pratyekabuddhas Have attained a certain level of meditation, But it is said to be limited in scope, And it can be surpassed.

source: སངས་རྒྱས་བསམ་གཏན་རྣམ་ཐར་ལ། །དགྲ་དང་བཅས་མེད་དོག་པ་མེད། །
en: “The meditative states and the liberations of a buddha Are unsurpassed, with no limitations.

source: སངས་རྒྱས་ཀྱི་ནི་སྟོབས་བདུན་པ། །ཕ་རོལ་རྒོལ་བས་ཐུལ་བར་དཀའ། །
en: This is the Buddha’s seventh power, Which opponents will struggle to defeat.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བདུན་པ་སྟེ་སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་བ་ནས་སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “This, Śāriputra, is the seventh of the tathāgatas’ tathāgata powers, and having attained that power he asserts the state of the supreme bull and roars the roar of the true lion, and so forth, until as nobody in this world has legitimately turned.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་བླ་ན་ མེད་པའི་ཡེ་ཤེས་ཀྱིས་བདག་དང་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་གི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། འདི་ལྟ་སྟེ། སྐྱེ་བ་གཅིག་གམ། །གཉིས་སམ། །གསུམ་མམ། བཞིའམ། ལྔ་འམ། བཅུ་འམ། ཉི་ཤུ་འམ། སུམ་ཅུ་འམ། བཞི་བཅུ་འམ། ལྔ་བཅུ་འམ། སྐྱེ་བ་བརྒྱ་འམ། སྐྱེ་བ་སྟོང་ངམ། སྐྱེ་བ་བརྒྱ་སྟོང་ནས་སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དུ་རྗེས་སུ་དྲན་ནོ། ། འཇིག་པའི་བསྐལ་པའམ། འཆགས་པའི་བསྐལ་པའམ། འཇིགས་པ་དང་། འཆགས་པའི་བསྐལ་པ་འམ། འཇིག་པའི་བསྐལ་པ་དུ་མ་འམ། འཆགས་པའི་བསྐལ་པ་དུ་མ་འམ། འཇིག་པ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་ཞིག་ནང་སྔོན་ཆེ་གེ་མོ་ཞིག་ཏུ་བྱུང་སྟེ མིང་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། རིགས་ནི་འདི་ཞེས་བྱ། ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཁ་དོག་ནི་འདི་ལྟ་བུ། མཚན་མ་ནི་འདི་ལྟ་བུ། དབྱིབས་ནི་འདི་ལྟ་བུ། ཚེ་ནི་འདི་ཙམ་ཞིག་ཐུབ། ཡུན་ནི་འདི་སྲིད་ཅིག་གནས་གནས། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་སྟེ། བདག་དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ། ། བདག་དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ། ། ཞེས་འདི་ལྟ་བུའི་རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས། གཞི་ཅི་ལས་གྱུར་པ་དང་བཅས་པར་བདག་དང་གཞན་གྱི་སྔོན་གྱི་གནས་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། སེམས་ཅན་གང་གི་སྔོན་གྱི་རྒྱུ་ཇི་ལྟ་བུ་དང་། རྒྱུ་གང་གིས་སེམས་ཅན་དུ་གྱུར་པའི་རྒྱུ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏེ། མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། ། འདས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་སེམས་ཅན་གྱི་རྒྱུད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་གང་གི་འོག་ཏུ་གང་ལ་དམིགས་པའི་སེམས་སྐྱེས་པ་དང་། དམིགས་པ་གང་མ་ཚང་བས་འགགས་པ་དེ་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What is the Tathāgata’s power of having clear experiential recollection of past states of existence? Śāriputra, with his unsurpassed knowledge, the Tathāgata can recollect his own various past states of existence and those of other people and other sentient beings. He can recollect one past lifetime, two, three, four, five, twenty, thirty, forty, or a hundred lifetimes, or a thousand or innumerable hundreds of thousands of millions of billions of lifetimes. He can remember as far back as an eon of destruction, an eon of evolution, an eon of destruction and evolution, a multitude of eons of destruction, a multitude of eons of evolution, and a multitude of eons of destruction and evolution, and he can state with precision, ‘At that time in the past I had this name, this kind of family, this class, this kind of job. I looked like this, had this gender, and was in this kind of physical condition. This was my lifespan, for that long did I remain, and in these ways I experienced happiness and suffering. Then, when I passed away, I took birth again in that place, and when I passed away again I took birth here.’ In this way, he recollects the details, the places, and the conditions of his own various previous states of existence and those of others. The Tathāgata knows the causes. He knows the past causes of a sentient being, as well as which causes govern what a sentient being becomes. With this knowledge, he then teaches the Dharma. He knows the mental continua of all sentient beings in the past. He knows the kinds of mental states in which the arising of particular kinds of mental objects is experienced instantly. He knows, too, what kinds of defective mental objects cause these mental states to disappear. The Tathāgata knows all these things.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་གང་སེམས་ཅན་གཅིག་གི་སེམས་གཅིག་ནས་གཅིག་ཏུ་སེམས་འདི་ལྟ་བུ་ཞིག་གི་འོག་ཏུ་སེམས་འདི་ལྟ་བུ་ཞིག་བྱུང་ངོ་། ། ཞེས་བྱ་བ་དེ་ནི་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཡང་ཚིག་གིས་བཤད་པས་སྟོན་མི་ནུས་ཏེ། དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡང་ཐམས་ཅད་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཐ་མའི་མཐའི་བར་གྱི་བསྐལ་པར་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དག་གི་སེམས་རྣམས་བཤད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐར་ཐུག་པར་མི་འགྱུར་རོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་ནི་བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མེད། ཚད་མེད། གྲངས་མེད། བརྗོད་དུ་མེད་དེ་དེའི་མཐའི་གནས་ནི་བདེ་བར་བསྟན་མི་ནུས་སོ། །
en: “Śāriputra, it is not possible to state in detail what kinds of mental events the continuous succession of mental events in the mind of a particular individual sentient being will lead to, because this would entail statements as numerous as the grains of sand in the river Ganges. Still, the Tathāgata knows everything about all sentient beings, and the Tathāgata could explain the minds of sentient beings to the very end of time, as there is no limit to the knowledge of the Tathāgata. Thus, Śāriputra, the Tathāgata’s power of having clear experiential recollection of past states of existence is inconceivable, incomparable, immeasurable, unfathomable, and inexpressible, so it is not easy to specify how far it reaches.

source: སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་ཏུ་གྱུར་པས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་དེ་དག་ལ་ཀྱེ་སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བ་དེ་དང་དེ་སངས་རྒྱས་ལ་བསྐྱེད་པའམ། ཉན་ཐོས་ལ་བསྐྱེད་པའམ། །རང་སངས་རྒྱས་ལ་བསྐྱེད་པའམ། ཆོས་ལ་བསྐྱེད་པ་དེ་དག་དྲན་པར་གྱིས་ཤིག་ཅེས་དྲན་པར་མཛད་དོ། ། འདི་ལྟ་སྟེ། དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་དྲན་པར་འགྱུར་རོ། ། དེ་བཞིན་གཤེགས་པས་དེ་དག་ལ་དགེ་བའི་རྩ་བ་ལ་དམིགས་པ་དེ་ལས་ཆོས་འདི་ལྟ་འདི་ལྟ་བུར་སྟོན་ཏེ། ། ཅི་ནས་སེམས་ཅན་དེ་དག་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལ་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས། ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་འབྱུང་བར་འགྱུར་རོ། ། ལ་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དོ། །
en: “The Tathāgata, the fearsome bull of a buddha, reminds sentient beings, ‘Listen, sentient beings, be mindful! These are the roots of virtue that spur one toward awakening, that spur one on as a śrāvaka, that spur one on as a pratyekabuddha, that spur one in the direction of the Dharma.’ They then remember them because of the authority of the Buddha. The Tathāgata will teach the Dharma in different ways, so that sentient beings can relate to these roots of virtue. In that way, they will not be liable to turn back from unsurpassed complete perfect awakening but will follow their inclinations, some by the Śrāvakayāna, some by the Pratyekabuddhayāna, and some by giving rise to the mind set on unsurpassed complete perfect awakening.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་ཤེས་པའི་སྟོབས་ནི་མཐའ་ཡས་མུ་མེད་དེ་ ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཐོས་ནས། མངོན་པར་དད། ཡིད་ཆེས། །རབ་ཏུ་རྟོག །སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས། ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་བར་དུའོ། །
en: “Śāriputra, the Tathāgata’s power of having clear experiential recollection of past states of existence is as boundless as space, and when the bodhisatva learns of this, he develops great faith, trust, and confidence, and he has no uncertainty or doubt about them, and so forth, as this power is inconceivable as space.”

source: བདག་གི་དང་ནི་དེ་བཞིན་གཞན་དག་གི། འཇིག་རྟེན་སྒྲོན་མས་སྔོན་གྱི་དྲན་པ་ནི། །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མཐའ་ཡས་པ། །སྐྱུ་རུ་ར་ལྔ་ལག་མཐིལ་བཞག་པ་བཞིན། །མིང་རུས་དེ་བཞིན་ཁ་དོག་རྣམ་པར་རྟོག །
en: “The light of the world can remember his past, And that of others, For unlimited millions of billions of eons, As clearly as he could see five gooseberries in the palm of his hand. “Name and clan, class and attitudes,

source: ཚེ་དང་གནས་དང་འཆི་འཕོ་འགྲོ་བ་དང་། །གང་གི་རྒྱུ་ལ་སེམས་ཅན་བརྩོན་ལྡན་པ། །དུས་མཁྱེན་པ་ནི་དེ་ལ་ཆོས་ཀྱང་འཆད། །
en: As well as lifespan and physical condition, death and fate— Whatever their past may be, the knower of time Will explain the Dharma to those who have vigor.

source: འགྲོ་བ་རྣམས་ཀྱི་སེམས་དང་སེམས་བྱུང་ཆོས། །གང་དག་འདས་པ་མཐའ་ཡས་མུ་མེད་པ། །གང་གི་འོག་ཏུ་སེམས་གང་བྱུང་བ་ཀུན། །རྒྱལ་བ་ཡེ་ཤེས་ཆེན་པོ་མངའ་བས་མཁྱེན། །
en: “The boundless number of past phenomena That constitute the minds and mental states of living beings And what results these will bring in the minds that follow— The Victorious One, the great wise one, knows all of them.

source: སེམས་ཅན་གཅིག་གི་སེམས་རྒྱུ་སྔོན་འདས་པ། །བདེ་བར་གཤེགས་པས་རབ་ཏུ་མཁྱེན་པ་ན་པ་ནི། །བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་དུ། །བཤད་ཀྱང་དེ་ཡི་མཐའ་མར་ཕྱིན་མི་འགྱུར། །
en: “The Sugata knows completely The past mental continuum of each sentient being, But as it extends over as many eons as there are grains of sand in the river Ganges, Were he to recount it there would be no end.

source: སྔོན་གྱི་སྤྱོད་པ་ཇི་སྙེད་དེ་དག་ནི། །ཕྱི་མའི་མཐའ་ཡི་བར་དུ་ངས་བཤད་ཀྱང་། །མཚུངས་པ་མེད་པའི་ཡེ་ཤེས་མི་ཟད་དེ། །
en: “Even if I were to recount deeds From the very beginning to the endless end, His incomparable knowledge would not be exhausted—

source: བཅོམ་ལྡན་ཡེ་ཤེས་རྒྱ་མཚོ་འདི་འདྲའོ། །
en: The Lord’s knowledge is like the ocean.

source: སྔོན་གྱི་རྒྱལ་ལ་བསྟི་སྟང་གང་བྱས་ཤིང་། །སེམས་ཅན་གང་དག་དགེ་བའི་བསམ་གྱུར་པ། །སངས་རྒྱས་རྫུ་འཕྲུལ་སྟོབས་ཀྱི་ཤུགས་ལ་གནས། །
en: “The wholesome inclinations of sentient beings, Veneration performed for victorious ones of the past— As he is firmly established in this awesome wonder-working buddha power,
